Repository: openstack-archive/murano-dashboard
Catalog: muranodashboard/locale/*/LC_MESSAGES/django.po
Languages: pt_br, zh_cn

source: Unable to communicate to murano-api server.
pt_br: Não foi possível se comunicar com o murano-api server.
zh_cn: 无法和 murano-api 服务通信。

source: Unable to create environment {0} due to: {1}
pt_br: Não foi possível criar o ambiente {0} por causa de: {1}
zh_cn: 无法创建环境 {0}，原因是：{1}

source: Unable to delete category
pt_br: Não foi possível remover a categoria
zh_cn: 无法删除目录

source: Unable to delete environment {0} due to: {1}
pt_br: Não foi possível remover o ambiente {0} por causa de: {1}
zh_cn: 无法删除环境 {0}，原因是：{1}

source: Unable to delete package in murano-api server
pt_br: Não foi possível remover o pacote no servidor murano-api
zh_cn: 无法在 murano-api 服务器上删除软件包

source: Unable to deploy. Try again later
pt_br: Não foi possível implantar. Tente novamente mais tarde
zh_cn: 无法部署，请稍后重试

source: Unable to download package.
pt_br: Não foi possível baixar pacote.
zh_cn: 无法下载软件包

source: Unable to get list of categories
pt_br: Não foi possível obter a lista de categorias
zh_cn: 无法获取目录列表

source: Unable to mark image
pt_br: Não foi possível marcar a imagem
zh_cn: 无法标记镜像

source: Unable to modify package
pt_br: Não foi possível modificar o pacote
zh_cn: 无法修改软件包

source: Unable to remove metadata
pt_br: Não foi possível remover metadados
zh_cn: 无法删除元数据

source: Unable to remove package.
pt_br: Não foi possível remover o pacote.
zh_cn: 无法移除软件包

source: Unable to retrieve availability zones.
pt_br: Não foi possível obter as zonas de disponibilidade
zh_cn: 无法获取可用区域

source: Unable to retrieve details for service
pt_br: Não foi possível obter detalhes do serviço
zh_cn: 无法获取服务详情

source: Unable to retrieve list of deployments
pt_br: Não foi possível obter a lista de implantações
zh_cn: 无法获取部署列表

source: Unable to retrieve list of images
pt_br: Não foi possível obter lista de imagens
zh_cn: 无法获取镜像列表

source: Unable to retrieve list of services. This environment is deploying or already deployed by other user.
pt_br: Não foi possível obter a lista dos serviços. Este ambiente está sendo implantado ou já foi implantado por outro usuário.
zh_cn: 无法获取服务列表。这个环境正在部署或者其他人已经部署了

source: Unable to retrieve package details.
pt_br: Não foi possível obter os detalhes do pacote
zh_cn: 无法获取软件包详情

source: Unable to retrieve project list.
pt_br: Não foi possível obter a lista de projeto.
zh_cn: 无法获取工程列表

source: Unable to retrieve public images.
pt_br: Não foi possível obter as imagens públicas.
zh_cn: 无法获取公共镜像。

source: Unavailable
pt_br: Indisponível
zh_cn: 不可用

source: Update
pt_br: Atualizar
zh_cn: 更新

source: Update Image
pt_br: Atualizar Imagem
zh_cn: 更新镜像

source: Updated
pt_br: Atualizado
zh_cn: 已更新

source: Uploading package failed. {0}
pt_br: Falha ao enviar o pacote. {0}
zh_cn: 上传软件包失败。{0}

source: Used for identifying and filtering packages.
pt_br: Usado para identificas e filtrar pacotes.
zh_cn: 用来标示和过滤软件包。

source: Validation Error occurred
pt_br: Ocorreu um erro de validação
zh_cn: 发生验证错误

source: Version
pt_br: Versão
zh_cn: 版本

source: Version of the package (optional).
pt_br: Versão do pacote (opcional).
zh_cn: 软件包版本（可选）。

source: You are not allowed to change this properties of the package
pt_br: Você não tem permissão para modificar as propriedades deste pacote.
zh_cn: 您不被允许修改这个软件包的属性

source: You are not allowed to delete this package
pt_br: Você não tem permissão para remover este pacote
zh_cn: 您不被允许删除这个软件包

source: You are not allowed to perform this operation
pt_br: Você não tem permissão para executar esta operação
zh_cn: 您不被允许执行这个操作

source: You'll have to configure each package installed from this bundle separately.
pt_br: Você terá que configurar cada pacote instalado deste conjunto individualmente.
zh_cn: 你需要为 Bundle 中的每个软件包单独进行设置。

source: {0}{1} don't match
pt_br: {0}{1} não correspondem
zh_cn: {0}{1}不匹配

source: Auto
zh_cn: 自动

source: Info
zh_cn: 信息
