Repository: openstack-archive/murano-dashboard
Catalog: muranodashboard/locale/*/LC_MESSAGES/django.po
Languages: pt_br, zh_cn

source: A local zip file to upload
pt_br: Um arquivo zip local para enviar
zh_cn: 从本地上传的一个 ZIP 压缩包

source: Abandon Environment
pt_br: Abandonar Ambiente
zh_cn: 放弃环境变量

source: Abandoned Environment
pt_br: Ambiente Abandonado
zh_cn: 已放弃环境变量

source: Active
pt_br: Ativo

source: Add
pt_br: Adicionar
zh_cn: 添加

source: Add Application
pt_br: Adicionar Aplicação
zh_cn: 添加应用程序

source: Add Application Category
pt_br: Adicionar Categoria de Aplicação.
zh_cn: 添加应用程序目录

source: Add Category
pt_br: Adicionar categoria
zh_cn: 添加目录

source: Add Component
pt_br: Adicionar componente
zh_cn: 增加组件

source: Add Murano Metadata
pt_br: Adicionar Metadados do Murano
zh_cn: 增加 Murano 元数据

source: Add New
pt_br: Adicionar Novo
zh_cn: 增加新的

source: Add new category to the application catalog.
pt_br: Adicionar nova categoria ao catálogo de aplicações.
zh_cn: 在应用程序目录中加入一个新分类。

source: Add to Env
pt_br: Adicionar ao ambiente
zh_cn: 添加到 Env 中

source: Adding application to an environment failed.
pt_br: Falha ao adicionar a aplicação a um ambiente.
zh_cn: 向环境中添加应用程序失败。

source: All
pt_br: Todos
zh_cn: 全部

source: Allows adding additional information about a package.
pt_br: Permite adicionar informações adicionais sobre o pacote.
zh_cn: 允许给软件包添加额外的信息。

source: Allows to hide a package from the catalog. (Applies to package dependencies)
pt_br: Permite esconder um pacote do catálogo. (Se aplica as dependências do pacote)
zh_cn: 允许把软件包从目录中隐藏。（同时应用到软件包的依赖）

source: An environment is a collection of applications that are meant to operate under similar conditions.
pt_br: Um ambiente é uma coleção de aplicações que devem operar sob condições semelhantes.
zh_cn: 环境是运行在相似条件下的应用程序的集合。

source: An external http/https URL to load the bundle from.
pt_br: Uma URL http/https externa de onde o conjunto será carregado.
zh_cn: 从外部的 http/https URL 来加载 Bundle。

source: An external http/https URL to load the package from.
pt_br: Uma URL http/https externa de onde o pacote será carregado.
zh_cn: 从外部的 http/https URL 来加载软件包。

source: App Category:
pt_br: Categoria de Aplicativos:
zh_cn: 应用程序目录：

source: App category
pt_br: Categoria de aplicação
zh_cn: 应用程序分类

source: Application Categories
pt_br: Categoria de Aplicações
zh_cn: 应用程序目录

source: Application Category
pt_br: Categoria da Aplicação
zh_cn: 应用程序目录

source: Application Details
pt_br: Detalhes da aplicação
zh_cn: 应用程序详情

source: Application Package
pt_br: Pacote da aplicação
zh_cn: 应用软件包

source: Application details
pt_br: Detalhes da aplicação
zh_cn: 应用程序详情

source: Application&nbsp;Components
pt_br: Aplicação&nbsp;Componentes
zh_cn: 应用程序组件

source: Applications
pt_br: Aplicações
zh_cn: 应用程序

source: Author
pt_br: Autor
zh_cn: 作者

source: Back
pt_br: Voltar
zh_cn: 返回

source: Bundle Name
pt_br: Nome do Conjunto
zh_cn: Bundle 名称

source: Bundle URL
pt_br: URL do conjunto

source: Bundle creation failed.Reason: Can't find Bundle name from repository.
pt_br: A criação do conjunto falhou. Motivo: Não foi possível encontrar o nome do repositório.
zh_cn: Bundle 创建失败，原因是：无法从仓库中找到该 Bundle。

source: Bundle creation failed.Reason: {0}
pt_br: A criação do conjunto falhou. Motivo: {0}
zh_cn: Bundle 创建失败，原因是：{0}

source: Bundle successfully imported.
pt_br: Conjunto importado com sucesso.
zh_cn: 已成功导入 Bundle

source: Bundle's full name.
pt_br: Nome completo do conjunto.
zh_cn: Bundle 全称。

source: Cancel
pt_br: Cancelar
zh_cn: 取消

source: Categories
pt_br: Categorias
zh_cn: 目录

source: Category Name
pt_br: Nome da Categoria
zh_cn: 目录名称

source: Category {0} created.
pt_br: Categoria {0} criada.
zh_cn: 目录{0}已创建

source: Check Keystone configuration of murano-api server.
pt_br: Verifique a configuração do Keystone no murano-api server.
zh_cn: 检查 Keystone 配置中关于 murano-api 服务的设置

source: Choose a Zip archive to upload into the catalog.
pt_br: Escolha um arquivo Zip para enviar ao catálogo.
zh_cn: 选择一个 ZIP 压缩包来上传到目录中。

source: Choose a name for the environment
pt_br: Escolha um nome para o ambiente
zh_cn: 给这个环境选一个名称

# Package requirements
source: Classes definition folder
pt_br: Pasta de definições de classes
zh_cn: Classes 定义文件夹

source: Click to create new environment
pt_br: Clique para criar um novo ambiente
zh_cn: 点击以创建新的环境

source: Component
pt_br: Componente
zh_cn: 组件

source: Component Details
pt_br: Detalhes do componente
zh_cn: 组件详情

source: Component List
pt_br: Lista de componentes
zh_cn: 组件列表

source: Component Logs
pt_br: Registros do componente
zh_cn: 组件日志

source: Components
pt_br: Componentes
zh_cn: 组件

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: Configure Application
pt_br: Configurar Aplicação
zh_cn: 设置应用程序

source: Confirm password
pt_br: Confirmar Senha
zh_cn: 确认密码

source: Could not retrieve latest status for the {0} environment
pt_br: Não foi possível obter o último estado para o ambiente {0}
zh_cn: 不能获取环境 {0} 的最近状态

source: Couldn't update environment. Reason:
pt_br: Não foi possível atualizar o ambiente. Razão:
zh_cn: 无法更新环境，原因是：

source: Couldn't update package {0} parameters. Error: {1}
pt_br: Não foi possível atualizar os parâmetros do pacote {0}. Erro: {1}

source: Create
pt_br: Criar
zh_cn: 创建

source: Create Env
pt_br: Criar ambiente
zh_cn: 创建 Env

source: Create Environment
pt_br: Criar ambiente
zh_cn: 创建环境

source: Create New
pt_br: Criar um novo
zh_cn: 新建

source: Create a title for an image.
pt_br: Criar um título para a imagem
zh_cn: 给镜像创建一个标题。

source: Created
pt_br: Criado
zh_cn: 已创建

source: Defines whether or not a package can be used by other tenants. (Applies to package dependencies)
pt_br: Define se um pacote pode ser usado por outros locatários. (Se aplica as dependências do pacote)
zh_cn: 定义一个软件包能否被其他租户使用。（同时应用到软件包的依赖）

source: Delete Category
pt_br: Deletar Categoria

source: Delete Component
pt_br: Remover Componente
zh_cn: 删除组件

source: Delete Environment
pt_br: Remover Ambiente
zh_cn: 删除环境变量

source: Delete Metadata
pt_br: Remover Metadado
zh_cn: 删除元数据

source: Delete Package
pt_br: Remover Pacote
zh_cn: 删除包

source: Deleted Category
pt_br: Categoria Deletada

source: Deleted Metadata
pt_br: Metadado Removido
zh_cn: 已删除的元数据

source: Deleted Package
pt_br: Pacote Removido
zh_cn: 已删除的包

source: Deploy Environment
pt_br: Implantar Ambiente
zh_cn: 部署环境变量

source: Deploy This Environment
pt_br: Implantar Este Ambiente
zh_cn: 部署这个环境

source: Deploy started
pt_br: Implatação iniciada
zh_cn: 部署已经开始

source: Deployed Components
pt_br: Componentes Implantados
zh_cn: 已部署的组件

source: Deployment Details
pt_br: Detalhes da Implantação
zh_cn: 部署详情

source: Deployment History
pt_br: Histórico da Implantação
zh_cn: 部署历史

source: Deployment Logs
pt_br: Registros de Implantação
zh_cn: 部署日志

source: Deployment with id %s doesn't exist anymore
pt_br: A implantação com id %s não existe mais
zh_cn: ID 为 %s 的部署不再存在

source: Deployments
pt_br: Implantações
zh_cn: 部署

source: Description
pt_br: Descrição
zh_cn: 描述

source: Details
pt_br: Detalhes
zh_cn: 详情

source: Download Package
pt_br: Baixar Pacote
zh_cn: 下载软件包

source: Drop Components here
pt_br: Coloque os componentes aqui

source: Enabled
pt_br: Habilitado
zh_cn: 已启用

source: Enter a complex password with at least one letter, one number and one special character
pt_br: Insira uma senha complexa, com pelo menos uma letra, um número e um carácter especial

source: Enter a password
pt_br: Insira uma senha
zh_cn: 输入密码

source: Environment
pt_br: Ambiente
zh_cn: 环境

source: Environment Default Network
pt_br: Rede padrão do ambiente
zh_cn: 环境默认网络

source: Environment Deployments
pt_br: Implantações de Ambientes
zh_cn: 环境部署

source: Environment Name
pt_br: Nome do Ambiente
zh_cn: 环境名称

source: Environment name must contain at least one non-white space symbol.
pt_br: O nome do ambiente deve conter pelo menos um caractere que não seja um espaço em branco.
zh_cn: 环境名称必须包含一个非空白字符

source: Environment with id %s doesn't exist anymore
pt_br: Ambiente com id %s não existe mais
zh_cn: ID 为 %s 的环境不再存在

source: Environment with specified name already exists
pt_br: Um ambiente com o nome especificado já existe
zh_cn: 已经存在相同名称的环境

source: Environments
pt_br: Ambientes
zh_cn: 环境

source: Error {0} occurred while installing images for {1}
pt_br: O erro {0} ocorreu durante a instalação das imagens para {1}
zh_cn: 安装镜像 {1} 时发生错误 {0}

source: Error {0} occurred while installing package {1}
pt_br: O erro {0} ocorreu durante a instalação do pacote {1}
zh_cn: 安装软件包 {1} 时发生错误 {0}

source: Error {0} occurred while parsing package {1}
pt_br: O erro {0} ocorreu durante a análise do pacote {1}
zh_cn: 解析软件包 {1} 时发生错误 {0}

source: Error {0} occurred while setting image {1}, {2} public
pt_br: O erro {0} ocorreu ao configurar a imagem {1}, {2} como pública
zh_cn: 设置镜像 {1}、{2} 为公有时发生错误 {0}

# Package requirements
source: Execution plans folder
pt_br: Pasta de planos de execução

source: FQN
pt_br: NTQ

source: Failed to create environment
pt_br: Falha ao criar ambiente
zh_cn: 创建环境失败

source: Failed to modify the package. {0}
pt_br: Falha ao modificar o pacote. {0}
zh_cn: 修改软件包失败。{0}

source: File
pt_br: Arquivo
zh_cn: 文件

source: Filter
pt_br: Filtro
zh_cn: 过滤

source: Find in a selected category
pt_br: Procure em uma categoria selecionada
zh_cn: 在所选分类中查找

source: First symbol should be latin letter or underscore. Subsequent symbols can be latin letter, numeric, underscore, at sign, number sign or dollar sign
pt_br: O primeiro símbolo deve ser uma letra latina ou sublinhado. Os símbolos subsequentes podem ser letras latinas, números, sublinhados, arroba, jogo da velha ou cifrão
zh_cn: 第一个字符需要是字母或下划线，后面的字符可以是字母、数字、下划线或者, @, #, $

source: Fully qualified package name.
pt_br: Nome totalmente qualificado do pacote.
zh_cn: 有效的软件包名称。

source: HTTP/HTTPS URL of the bundle file.
pt_br: URL HTTP/HTTPS do arquivo do conjunto.
zh_cn: Bundle 文件的 HTTP/HTTPS URL。

source: HTTP/HTTPS URL of the package file.
pt_br: URL HTTP/HTTPS do arquivo do pacote.
zh_cn: 软件包文件的 HTTP/HTTPS URL。

source: Heat Orchestration stack name
pt_br: Nome do Stack de Orquestração do Heat

source: Heat Orchestration stack%(forloop.counter)s name
pt_br: Nome do stack%(forloop.counter)s de Orquestração do Heat

source: If packages depend upon other packages and/or require specific glance images, those are going to be installed with them from murano repository.
pt_br: Se os pacotes dependem de outros pacotes e/ou precisam de imagens específicas do glance, estas serão instaladas com eles do repositório do Murano
zh_cn: 如果软件包依赖其他的软件包或特定的 Glance 镜像，那么它们也会从 Murano 仓库中获取并安装。

source: If the package depends upon other packages and/or requires specific glance images, those are going to be installed with it from murano repository.
pt_br: Se o pacote depende de outros pacotes e/ou precisa de imagens específicas do glance, estes serão instaladas com ele a partir do repositório do Murano
zh_cn: 如果软件包依赖其他的软件包或特定的 Glance 镜像，那么它们也会从 Murano 仓库中获取并安装。

source: Image
pt_br: Imagem
zh_cn: 镜像

source: Image Title
pt_br: Título da Imagem
zh_cn: 镜像标题

source: Image Type
pt_br: Tipo de Imagem
zh_cn: 镜像类型

source: Image successfully marked
pt_br: Imagem marcada com sucesso
zh_cn: 镜像标记成功

source: Images
pt_br: Imagens
zh_cn: 镜像

source: Import Bundle
pt_br: Importar Conjunto
zh_cn: 导入 Bundle

source: Import Package
pt_br: Importar Pacote
zh_cn: 导入软件包

source: Importing package {0} failed. Reason: {1}
pt_br: Falha ao importar o pacote {0}. Motivo: {1}
zh_cn: 导入软件包 {0} 失败，原因是：{1}

source: Instance name
pt_br: Nome da instância
zh_cn: 实例名称

source: Instance%(forloop.counter)s name
pt_br: Nome da Instância%(forloop.counter)s
zh_cn: 实例 %(forloop.counter)s 的名称

source: Invalid metadata for image: {0}
pt_br: Metadados inválidos para a imagem: {0}

source: Invalid murano image metadata
pt_br: Metadados da imagem do murano inválidos
zh_cn: 无效的 murano 镜像元数据。

source: Invalid value of 'murano_nets' option
pt_br: Valor inválido na opção 'murano_nets'
zh_cn: “murano_nets”的值无效

source: It is forbidden to upload files larger than {0} MB.
pt_br: Não é permitido enviar arquivos maiores do que {0} MB.
zh_cn: 禁止上传超过 {0} MB 大小的文件。

source: KeyWord
pt_br: Palavra Chave
zh_cn: 关键字

source: Last operation
pt_br: Última operação
zh_cn: 上次操作

source: Latest Deployment Log
pt_br: Registros da última implantação
zh_cn: 上次部署日志

source: License
pt_br: Licença
zh_cn: 许可证

source: Logs
pt_br: Registros
zh_cn: 日志

source: Manage
pt_br: Gerenciar
zh_cn: 管理

source: Manage Components
pt_br: Gerenciar Componentes
zh_cn: 管理组件

# Package requirements
source: Manifest file
pt_br: Arquivo de manifesto
zh_cn: Manifest 文件

source: Mark Image
pt_br: Marcar Imagem
zh_cn: 标记镜像

source: Mark an image with Murano specific metadata to be added to the selected image.
pt_br: Marcar uma imagem com específico metadados do Murano para ser adicionado na imagem selecionada.

source: Marked Images
pt_br: Imagens Marcadas
zh_cn: 已标记的镜像

source: Modify Package
pt_br: Modificar Pacote
zh_cn: 修改软件包

source: Modifying package failed
pt_br: Falha ao modificar pacote
zh_cn: 修改软件包失败

source: NO ENVIRONMENTS
pt_br: NENHUM AMBIENTE
zh_cn: 没有环境

source: Name
pt_br: Nome
zh_cn: 名称

source: Name of the bundle.
pt_br: Nome do conjunto.
zh_cn: Bundle 名称

source: Network of '%s'
pt_br: Rede de '%s'
zh_cn: %s的网络

source: Next
pt_br: Próximo
zh_cn: 下一步

source: Next Page
pt_br: Próxima Página
zh_cn: 下一页

source: No availability zones available
pt_br: Nenhuma zona de disponibilidade disponível
zh_cn: 没有可用区域

source: No categories available
pt_br: Nenhuma categoria disponível
zh_cn: 没有可用的目录

source: No components
pt_br: Nenhum componente
zh_cn: 没有组件

source: No images available
pt_br: Sem imagens disponíveis
zh_cn: 没有可用镜像

source: No keypair
pt_br: Sem par de chaves
zh_cn: 没有密钥对

source: No license
pt_br: Nenhuma licença
zh_cn: 没有许可证

source: No recent activity to report at this time.
pt_br: Não há atividades recentes para relatar neste momento.
zh_cn: 当前时间没有最近的活动报告

source: No requirements
pt_br: Nenhum requisito
zh_cn: 没有要求

source: None
pt_br: Nenhum
zh_cn: 无

source: Not in domain
pt_br: Fora do domínio
zh_cn: 不在域中

source: Note
pt_br: Nota
zh_cn: 提示

source: OpenStack Networking (Neutron) is not available in current environment. Custom Network Settings cannot be applied
pt_br: O módulo de rede do OpenStack (Neutron) não está disponível no ambiente atual. As regras de rede padrão não podem ser aplicadas.
zh_cn: OpenStack 网络服务（Neuron）当前环境不可用。无法应用自定义的网络设置。

source: Operation is forbidden by murano-api server.
pt_br: Operação proibida pelo murano-api server
zh_cn: 操作被 murano-api 服务禁止。

source: Optional
pt_br: Opcional
zh_cn: 可选

source: Overview
pt_br: Visão Geral
zh_cn: 概览

source: Package Bundle Source
pt_br: Origem do Conjunto de Pacotes
zh_cn: 软件包 Bundle 源

source: Package Count
pt_br: Contagem de Pacotes
zh_cn: 软件包数目

source: Package Details
pt_br: Detalhes do Pacote
zh_cn: 软件包详情

source: Package Name
pt_br: Nome do Pacote
zh_cn: 软件包名称

source: Package Source
pt_br: Origem do Pacote
zh_cn: 软件源

source: Package Tags
pt_br: Etiquetas de pacotes
zh_cn: 软件包标签

source: Package URL
pt_br: URL do Pacote
zh_cn: 软件包 URL

source: Package Version
pt_br: Versão do Pacote
zh_cn: 软件包版本

source: Package creation failed.Reason: Can't find Package name from repository.
pt_br: Falha ao criar o pacote. Motivo: Não foi possível encontrar o nome do pacote no repositório.
zh_cn: 软件包创建失败，原因是：无法从仓库里找到该软件包。

source: Package creation failed.Reason: {0}
pt_br: Falha ao criar o pacote. Motivo: {0}
zh_cn: 软件包创建失败，原因是：{0}

source: Package modified.
pt_br: Pacote modificado.
zh_cn: 软件包已修改。

source: Package name in the repository, usually a fully qualified name
pt_br: Nome do pacote no repositório, geralmente é um nome totalmente qualificado.
zh_cn: 仓库中软件包的名称，通常是完整的名称

source: Package or Class with the same name is already made public
pt_br: Um Pacote ou Classe com o mesmo nome já foi tornado público
zh_cn: 相同名字的软件包或类已经是公有的

source: Package parameters successfully updated.
pt_br: Parâmetros do pacote atualizados com sucesso.
zh_cn: 已成功更新软件包参数

source: Package version
pt_br: Versão do Pacote
zh_cn: 软件包版本

source: Package with id {0} is not found
pt_br: Pacote com id {0} não foi encontrado
zh_cn: 没有发现 ID 为 {0} 的软件

source: Package with specified name already exists
pt_br: Um pacote com o nome especificado já existe
zh_cn: 已经存在相同名称的软件包

source: Package {0} already registered.
pt_br: O pacote {0} já está registrado
zh_cn: 已注册软件包 {0}

source: Package {0} upload failed. {1}
pt_br: O envio do pacote {0} falhou. {1}
zh_cn: 软件包 {0} 上传失败。{1}

source: Package {0} uploaded
pt_br: Pacote {0} enviado
zh_cn: 已上传软件包 {0}

source: Packages
pt_br: Pacotes
zh_cn: 软件包

source: Packages should contain:
pt_br: Pacotes devem conter:
zh_cn: 软件包应该包括：

source: Please confirm your password
pt_br: Por favor confirme a sua senha
zh_cn: 请确认您的密码

source: Please supply a bundle name
pt_br: Por favor dê um nome ao conjunto
zh_cn: 请提供一个 Bundle 名称

source: Please supply a bundle url
pt_br: Por favor forneça uma url para o conjunto
zh_cn: 请提供一个 Bundle URL

source: Please supply a package file
pt_br: Por favor forneça o arquivo do pacote
zh_cn: 请提供一个软件包文件

source: Please supply a package name
pt_br: Por favor forneça um nome para o pacote
zh_cn: 请提供一个软件包名称

source: Please supply a package url
pt_br: Por favor forneça uma url para o pacote
zh_cn: 请提供一个软件包 URL

source: Previous Page
pt_br: Página Anterior
zh_cn: 上一页

source: Provide desired name for a new category
pt_br: Forneça o nome desejado para uma nova categoria
zh_cn: 给新集合取一个名称

source: Public
pt_br: Público
zh_cn: 公有

source: Quick Deploy
pt_br: Implantação Rápida
zh_cn: 快速部署

source: Recent Activity
pt_br: Atividade Recente
zh_cn: 最近的活动

source: Repository
pt_br: Repositório
zh_cn: 仓库

source: Requested object is not found on murano server.
pt_br: O objeto solicitado não foi encontrado no servidor do murano
zh_cn: 无法在 murano 服务器上找到所请求的对象。

source: Requested operation conflicts with an existing object.
pt_br: A operação solicitada tem conflito com um objeto existente.
zh_cn: 请求的操作和已存在的对象冲突。

source: Requirements
pt_br: Requisitos
zh_cn: 需求

source: Retype your password
pt_br: Digite sua senha novamente
zh_cn: 重新输入密码

source: Select Application
pt_br: Selecione um aplicação
zh_cn: 选择应用

source: Select Image
pt_br: Selecione a Imagem
zh_cn: 选择镜像

source: Select an image registered in Glance Image Services.
pt_br: Selecione uma imagem registrada no Serviço de Imagens Glance.
zh_cn: 在 Glance 镜像服务中选择一个已注册的镜像。

source: Select an image type supported by Murano.
pt_br: Selecione um tipo de imagem suportado pelo Murano
zh_cn: 选择一个 Murano 支持的镜像类型。

source: Select one or more categories for a package.
pt_br: Selecione uma ou mais categorias para um pacote
zh_cn: 为软件包选择一个或多个分类。

source: Set up for identifying a package.
pt_br: Configure para identificar um pacote
zh_cn: 为软件包设置标示。

source: Show Details
pt_br: Mostrar detalhes
zh_cn: 显示详情

source: Something went wrong during package downloading
pt_br: Algo deu errado ao baixar o pacote.
zh_cn: 下载软件包的时候发生错误

source: Sorry, this environment doesn't exist anymore
pt_br: Desculpe, este ambiente não existe mais
zh_cn: 对不起，这个环境不再存在

source: Sorry, you can't add application right now. The environment is deploying.
pt_br: Desculpe, você não pode adicionar esta aplicação agora. O ambiente está sendo implantado.
zh_cn: 对不起，您现在不能添加应用程序。当前环境正在部署。

source: Sorry, you can't delete service right now
pt_br: Desculpe, você não pode remover o serviço agora
zh_cn: 对不起，您现在不能删除服务

source: Specified title already in use. Please choose another one.
pt_br: O título especificado já esta em uso. Por favor escolha outro.
zh_cn: 指定的名称已被使用，请更换

source: Specifying a category helps to filter applications in the catalog
pt_br: Especificar uma categoria ajuda a filtrar aplicações no catálogo
zh_cn: 指定一个分类有助于在目录中进行过滤

source: Status
pt_br: Estado
zh_cn: 状态

source: Step {0}
pt_br: Passo {0}
zh_cn: 步骤 {0}

source: Tags
pt_br: Etiquetas
zh_cn: 标签

source: Tenant Name
pt_br: Nome do Locatário
zh_cn: 租户名称

source: The '{0}' application successfully added to environment.
pt_br: A aplicação '{0}' foi adicionada com sucesso ao ambiente.
zh_cn: 第 '{0}' 个应用程序已成功添加到环境中。

source: The VMs of the applications in this environment will join this net by default, unless configured individually. Choosing 'Create New' will generate a new Network with a Subnet having an IP range allocated among the ones available for the default Murano Router of this project
pt_br: As VMs das aplicações neste ambiente se conectarão a esta rede por padrão, a menos que sejam configuradas individualmente. Escolher 'Criar Nova' criara uma nova rede com uma subrede contendo um conjunto de IPs alocados dentre os disponíveis para o roteador padrão do Murano deste projeto.
zh_cn: 除非单独设置，否则这个环境中的应用的虚拟机会自动加入这个网络。选择“新建”会创建一个网络，子网的 IP 段是从这个工程默认的 Murano 路由器的可用资源中分配的。

source: The bundle is going to be installed from <a href="%(murano_repo_url)s" target="_blank">%(murano_repo_url)s</a> repository.
pt_br: O conjunto será instalado do repositório <a href="%(murano_repo_url)s" target="_blank">%(murano_repo_url)s</a>.
zh_cn: 将从 <a href="%(murano_repo_url)s" target="_blank">%(murano_repo_url)s</a> 这个仓库安装 Bundle。

source: The package is going to be imported from <a href="%(murano_repo_url)s" target="_blank">%(murano_repo_url)s</a> repository.
pt_br: O pacote será importado do repositório <a href="%(murano_repo_url)s" target="_blank">%(murano_repo_url)s</a>.
zh_cn: 将从 <a href="%(murano_repo_url)s" target="_blank">%(murano_repo_url)s</a> 这个仓库导入软件包。

source: The password must contain at least one letter, one number and one special character
pt_br: A senha deve conter pelo menos uma letra, um número e um caractere especial
zh_cn: 密码必须包含至少一个字面、一个数字和一个特殊字符

source: The request data is not acceptable by the server
pt_br: O dado solicitado não é adequado para o servidor.
zh_cn: 请求的数据不能被服务器接受

source: There are no applications in the catalog. You can import apps from
pt_br: Não existem aplicações neste catálogo. Você pode importas aplicações de

source: There are no applications matching your criteria.
pt_br: Não há aplicações correspondentes aos seus critérios.
zh_cn: 没有和您的条件匹配的应用程序。

source: This action cannot be undone. Any resources created by this environment will have to be released manually.
pt_br: Esta ação não pode ser desfeita. Qualquer recurso criado por este ambiente deverá ser liberado manualmente.
zh_cn: 这个动作不能撤消。这个环境创建的所有资源需要手动释放。

source: This name is already taken.
pt_br: Este nome já está em uso
zh_cn: 这个名字已经被使用

source: Time Finished
pt_br: Horário de Término

source: Time Started
pt_br: Horário de Início

source: Time updated
pt_br: Hora atualizada
zh_cn: 时间已更新

source: Title
pt_br: Título
zh_cn: 标题

source: Toggle Active
pt_br: Alternar Ativo

source: Toggle Enabled
pt_br: Alternar Habilitado

source: Toggle Public
pt_br: Alternar Público

source: Toggled Active
pt_br: Alternar Ativo

source: Toggled Public
pt_br: Alternado Público

source: Topology
pt_br: Topologia
zh_cn: 拓扑

source: Trying to add {0} image to glance. Image will be ready for deployment after successful upload
pt_br: Tentando adicionar a imagem {0} ao glance. A imagem estará pronta para implantação depois de ser enviada com sucesso
zh_cn: 正在尝试把镜像 {0} 加入到 Glance 中。上传成功后镜像就可以用来部署

source: Trying to add {0}, {1} image to glance. Image will be ready for deployment after successful upload
pt_br: Tentando adicionar a imagem {0}, {1} ao glance. A imagem estará pronta para implantação depois de ser enviada com sucesso
zh_cn: 正在尝试把镜像 {0}, {1} 加入到 Glance 中。上传成功后镜像就可以用来部署

source: Type
pt_br: Tipo
zh_cn: 类型

# Package requirements
source: UI definition folder
pt_br: Pasta de definições de UI
zh_cn: UI 定义文件夹

source: UNKNOWN
pt_br: DESCONHECIDO
zh_cn: 未知

source: Unable to abandon an environment {0} due to: {1}
pt_br: Não foi possível abandonar o ambiente {0} por causa de: {1}
zh_cn: 无法丢弃环境 {0}，原因是：{1}
